{
  "irVersion": "3",
  "producerName": "keras2onnx",
  "producerVersion": "1.13.0",
  "domain": "onnxmltools",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "input_1"
        ],
        "output": [
          "adjusted_input"
        ],
        "name": "Transpose",
        "opType": "Transpose",
        "attribute": [
          {
            "name": "perm",
            "ints": [
              "0",
              "3",
              "1",
              "2"
            ],
            "type": "INTS"
          }
        ],
        "docString": "",
        "domain": ""
      },
      {
        "input": [
          "adjusted_input",
          "conv2d/kernel:0",
          "conv2d/bias:0"
        ],
        "output": [
          "convolution_output"
        ],
        "name": "conv2d",
        "opType": "Conv",
        "attribute": [
          {
            "name": "auto_pad",
            "s": "VkFMSUQ=",
            "type": "STRING"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "convolution_output"
        ],
        "output": [
          "conv2d/Relu:01"
        ],
        "name": "Relu",
        "opType": "Relu",
        "docString": "",
        "domain": ""
      },
      {
        "input": [
          "conv2d/Relu:01"
        ],
        "output": [
          "conv2d"
        ],
        "name": "PushTranspose_1",
        "opType": "Transpose",
        "attribute": [
          {
            "name": "perm",
            "ints": [
              "0",
              "2",
              "3",
              "1"
            ],
            "type": "INTS"
          }
        ],
        "docString": "",
        "domain": ""
      }
    ],
    "name": "convK3",
    "initializer": [
      {
        "dims": [
          "32",
          "3",
          "3",
          "3"
        ],
        "dataType": 1,
        "floatData": [
          -0.001952514,
          -0.1280347,
          -0.1122293,
          -0.02852416,
          -0.029833615,
          -0.0066639036,
          -0.07271866,
          -0.12040429,
          0.11047836,
          0.05709897,
          -0.10106355,
          -0.09367989,
          0.009412512,
          0.07138677,
          -0.12747687,
          0.074630335,
          -0.10177933,
          -0.13681678,
          0.017606884,
          -0.041072838,
          0.009773999,
          0.120941505,
          0.014775112,
          0.10860193,
          0.07272306,
          -0.013239086,
          -0.03785099,
          -0.011997223,
          0.071147576,
          0.015051812,
          -0.05869133,
          0.0820359,
          -0.08373843,
          -0.040308125,
          -0.09223122,
          -0.07231623,
          -0.00028721988,
          -0.024408251,
          0.11273195,
          -0.0161563,
          0.08991547,
          -0.08569549,
          -0.0910376,
          -0.0116209835,
          0.10736546,
          0.12447344,
          0.01353471,
          0.10343464,
          -0.047660366,
          -0.12219487,
          -0.08993844,
          0.015239209,
          -0.029101975,
          -0.112240784,
          0.096657425,
          0.0351239,
          -0.10563463,
          0.07332206,
          -0.033946134,
          -0.056005143,
          -0.053057946,
          -0.023977496,
          0.06327146,
          0.11464374,
          0.07996066,
          0.04278198,
          -0.091799185,
          0.06086023,
          0.037662342,
          0.03381738,
          0.09736721,
          -0.12348208,
          0.11518745,
          -0.017880812,
          0.12974466,
          0.089192614,
          -0.11309437,
          0.025500566,
          -0.0028712451,
          0.050133556,
          -0.088124625,
          -0.098722994,
          -0.13196164,
          0.116712734,
          0.05907905,
          -0.12702133,
          0.04624127,
          -0.11870922,
          -0.002530381,
          -0.05491533,
          -0.023726366,
          -0.030017719,
          0.029147252,
          0.0033128709,
          -0.12122549,
          0.07135764,
          0.033999935,
          -0.13303924,
          -0.018139772,
          -0.05063375,
          0.036549732,
          0.040086344,
          -0.07085785,
          -0.0736391,
          -0.043261178,
          -0.01992552,
          0.05715342,
          -0.086244635,
          3.0830503e-05,
          0.003796935,
          -0.10725698,
          0.05548629,
          -0.012373194,
          -0.13377546,
          0.085826814,
          -0.050358564,
          -0.048318036,
          0.00022947788,
          0.08318846,
          0.0066768974,
          -0.023788363,
          0.015667394,
          0.13526492,
          -0.02038037,
          0.052832946,
          0.052342996,
          0.008076698,
          -0.029747471,
          -0.03151805,
          0.103077754,
          -0.10508825,
          -0.03479524,
          -0.0822283,
          -0.12225667,
          -0.12568118,
          0.020794109,
          -0.039537363,
          -0.12945145,
          0.06505671,
          -0.033271223,
          0.013881028,
          0.0576113,
          -0.098252326,
          -0.017678253,
          -0.10051111,
          0.028017059,
          0.12451108,
          -0.13266034,
          -0.036078207,
          -0.09355857,
          0.039120883,
          0.08367914,
          0.033685133,
          0.06755693,
          0.1232283,
          0.016299441,
          -0.06950424,
          -0.105006605,
          0.055117965,
          0.062278196,
          0.016958594,
          -0.09446293,
          0.078880295,
          -0.031004235,
          0.013455898,
          0.087661654,
          -0.07676862,
          -0.10428527,
          -0.051111527,
          -0.11662075,
          0.12789406,
          0.07150088,
          0.0074923187,
          -0.022279173,
          0.023008347,
          -0.057245262,
          0.060152575,
          -0.036541276,
          -0.030933857,
          0.11932908,
          0.10562259,
          -0.022581674,
          0.039279953,
          0.011718512,
          0.110365435,
          0.017419323,
          -0.042594425,
          -0.13793539,
          0.038883045,
          0.05382213,
          -0.001413852,
          -0.11055665,
          -0.057037532,
          0.041689113,
          0.0808713,
          0.11141124,
          -0.0186164,
          -0.102038555,
          -0.117426924,
          -0.13319205,
          0.10482554,
          -0.028187312,
          -0.111916736,
          -0.023181953,
          -0.13462536,
          0.12758096,
          -0.006812498,
          0.068560004,
          0.07240175,
          -0.06728467,
          -0.08153052,
          -0.087884255,
          0.1204655,
          0.025898188,
          -0.106536,
          0.13522537,
          0.018954992,
          -0.016413681,
          -0.07251073,
          0.13130067,
          0.027359039,
          -0.09472416,
          -0.009217247,
          0.09738502,
          0.09670909,
          -0.13213018,
          0.02578716,
          0.06569944,
          -0.12431734,
          -0.12540945,
          -0.095678896,
          -0.06744591,
          0.054827377,
          -0.07885262,
          -0.05273436,
          -0.07411346,
          0.13534705,
          0.12803192,
          0.12696214,
          -0.035299644,
          -0.110681325,
          0.106490195,
          -0.11463047,
          -0.10427734,
          0.021622464,
          -0.021146856,
          0.019112378,
          -0.020654365,
          0.010217622,
          0.05913575,
          0.095872074,
          0.008787841,
          0.029101714,
          -0.11557655,
          0.03475371,
          -0.061696008,
          -0.025225677,
          0.08213475,
          0.034522295,
          0.12098993,
          -0.10255957,
          -0.03903053,
          0.049978614,
          -0.042311445,
          0.08097702,
          -0.08096113,
          -0.10404125,
          0.086554796,
          0.13627173,
          0.07430023,
          -0.023674935,
          0.096274376,
          0.10204221,
          -0.090692356,
          0.040262297,
          -0.09790926,
          -0.0010357797,
          -0.0012094527,
          0.10945156,
          -0.12981233,
          0.10235757,
          -0.017164603,
          -0.12336754,
          -0.05603894,
          0.090368435,
          0.021441445,
          0.03920266,
          0.032422766,
          -0.11132553,
          -0.059388652,
          0.12644817,
          -0.056483977,
          0.015099794,
          0.0077303797,
          -0.11584288,
          -0.109502636,
          -0.070060104,
          0.11800416,
          0.015381977,
          0.09941028,
          0.10866211,
          -0.06975208,
          0.058416054,
          -0.02327606,
          -0.115085475,
          -0.07033144,
          -0.09769419,
          0.03327313,
          -0.06531884,
          -0.035607174,
          0.041699737,
          -0.12831308,
          0.072465554,
          -0.0051385313,
          -0.085185334,
          -0.007091135,
          0.029464096,
          -0.059336893,
          0.057157174,
          0.13499747,
          0.10936707,
          0.10652889,
          0.12924404,
          0.05277346,
          -0.00097066164,
          0.03841278,
          0.082319185,
          0.11636321,
          0.033466056,
          0.13237093,
          -0.05109991,
          0.022943065,
          0.03106679,
          -0.119560644,
          -0.023108281,
          0.03265153,
          0.029652402,
          -0.024510294,
          -0.082834244,
          0.08702047,
          0.016398221,
          0.08267225,
          0.114644274,
          0.039200187,
          -0.11125528,
          -0.117174014,
          0.13044216,
          0.033010453,
          -0.042901196,
          -0.05400706,
          -0.10324531,
          0.05024205,
          -0.08344762,
          -0.022712402,
          -0.10245332,
          0.03305398,
          -0.11773142,
          0.11634375,
          0.0746962,
          -0.0132686645,
          -0.10930757,
          -0.12200564,
          -0.120067574,
          0.03644523,
          -0.1267289,
          0.079914495,
          -0.0368594,
          0.049043387,
          0.099294215,
          0.06603739,
          -0.028698921,
          -0.046487994,
          0.090489596,
          0.09991439,
          0.056706935,
          -0.00494653,
          -0.061382458,
          0.0021829158,
          0.050570667,
          0.014822692,
          -0.08305062,
          -0.102949366,
          0.041882172,
          0.089787796,
          0.10150513,
          -0.021412656,
          -0.04412914,
          0.022108898,
          0.024401769,
          0.0924523,
          -0.07468643,
          -0.045564517,
          0.04369183,
          0.090066865,
          0.12902598,
          0.065757915,
          -0.056008264,
          0.05423726,
          -0.015164845,
          0.0014618635,
          0.015585631,
          -0.068955354,
          0.051302046,
          0.13571756,
          0.11480336,
          0.06186208,
          -0.052702248,
          -0.0685806,
          -0.08859187,
          0.04685965,
          -0.016719535,
          -0.059040584,
          -0.00088362396,
          -0.064139426,
          0.0021609366,
          -0.045972675,
          0.070683554,
          -0.068854004,
          -0.11518297,
          0.097768426,
          0.11803256,
          -0.10891147,
          0.049552098,
          0.07073988,
          -0.105064586,
          0.11324398,
          -0.11737506,
          0.10013287,
          -0.004000187,
          -0.020071782,
          0.12441079,
          0.045860305,
          -0.06270579,
          0.05643165,
          -0.039315686,
          0.12897585,
          -0.0025550276,
          -0.04696498,
          0.034125566,
          -0.05997926,
          -0.10444206,
          -0.08989455,
          0.09035215,
          0.0046388656,
          -0.07053416,
          -0.057826556,
          -0.11012536,
          0.072909236,
          -0.09586221,
          -0.06882844,
          -0.11767717,
          -0.01972171,
          -0.021140471,
          -0.08740282,
          -0.04583878,
          0.13109846,
          0.13544802,
          -0.063717455,
          -0.12345859,
          -0.08261779,
          -0.04210365,
          0.1185772,
          0.074869215,
          0.07967372,
          -0.033838794,
          -0.07818692,
          0.06899747,
          -0.09735494,
          0.008198291,
          0.081876844,
          -0.03384906,
          0.015446901,
          -0.12514092,
          0.08243929,
          0.010992438,
          0.1302944,
          0.06389369,
          -0.015395306,
          0.042492986,
          -0.05920294,
          0.030710593,
          0.06737839,
          0.10266589,
          -0.12872879,
          0.07938345,
          0.114078864,
          -0.13585222,
          -0.056861818,
          0.114182934,
          0.09807147,
          -0.06920293,
          -0.0019825846,
          -0.07011173,
          0.07510787,
          -0.008803964,
          0.077660576,
          -0.13719954,
          -0.088150024,
          -0.11447585,
          0.0032465607,
          0.049553186,
          0.01928927,
          0.055386856,
          -0.09569804,
          0.065173075,
          -0.078282475,
          -0.12853123,
          -0.040670313,
          0.039865255,
          0.104027465,
          0.13674162,
          0.12100117,
          0.12775715,
          0.099898785,
          0.05810924,
          -0.04752697,
          -0.09498819,
          -0.023006015,
          -0.10454179,
          0.103296384,
          -0.02376993,
          0.006561175,
          -0.005780861,
          -0.020883322,
          0.13455538,
          -0.055640586,
          -0.008871645,
          -0.01280649,
          0.08525427,
          0.017763838,
          -0.10244677,
          -0.043330148,
          0.057134867,
          -0.061177492,
          -0.04445026,
          -0.087981686,
          -0.012100711,
          -0.07438759,
          -0.031280473,
          -0.0014698952,
          0.024580881,
          -0.0034258664,
          -0.014371045,
          -0.030704603,
          0.09865464,
          0.09598528,
          0.12329234,
          -0.023718566,
          -0.0314041,
          0.1296738,
          -0.13242629,
          0.13543771,
          -0.055896625,
          0.035220206,
          -0.08387302,
          -0.09039602,
          -0.12094218,
          0.07552028,
          -0.11737793,
          0.09811826,
          -0.01278536,
          -0.0021615922,
          -0.1341145,
          0.07604574,
          -0.0027959347,
          -0.1368831,
          -0.10733012,
          -0.095446095,
          0.120480135,
          0.09447609,
          0.11608647,
          0.11323835,
          -0.13760726,
          0.10188854,
          -0.031423673,
          -0.13326411,
          -0.10471672,
          -0.035833426,
          0.021841869,
          -0.046311952,
          0.12015943,
          0.116123065,
          0.07514042,
          0.04760337,
          0.010687545,
          0.009880677,
          0.06644735,
          -0.05993405,
          0.03968452,
          0.07403034,
          -0.13148418,
          0.049788818,
          -0.089707516,
          -0.035906374,
          0.0061330795,
          -0.01630789,
          0.03389272,
          -0.020740114,
          0.11097737,
          0.06343411,
          -0.07049599,
          -0.0054578036,
          -0.05745312,
          0.09279613,
          0.099935874,
          -0.1379783,
          -0.07012799,
          -0.031147934,
          -0.12814628,
          0.09333219,
          0.049771085,
          -0.07953727,
          -0.065193206,
          -0.052571617,
          -0.011970893,
          -0.10962698,
          0.056131303,
          0.027953595,
          0.08551261,
          0.07583135,
          -0.099781446,
          0.019882023,
          -0.10518123,
          0.07562086,
          -0.06436986,
          0.118940964,
          0.0065154284,
          -0.13432293,
          0.13723685,
          -0.045095228,
          0.1216871,
          0.10988858,
          0.09207621,
          0.021583825,
          -0.06648173,
          -0.06370377,
          0.04984282,
          0.07979643,
          0.12492667,
          0.036554694,
          -0.07633579,
          -0.111350015,
          -0.076898396,
          0.11054987,
          0.120125964,
          -0.11685737,
          -0.021531284,
          0.098513946,
          0.12607156,
          0.088722974,
          0.03025265,
          0.1114302,
          0.04132712,
          -0.0237801,
          0.11769657,
          0.06491405,
          -0.008544505,
          -0.121573694,
          0.0101726055,
          -0.13035756,
          -0.1321406,
          0.039651543,
          -0.10971461,
          -0.09391852,
          0.001825735,
          -0.08808468,
          0.12817015,
          -0.06752248,
          0.037092984,
          0.07251175,
          -0.0051217824,
          0.11541338,
          -0.014528267,
          0.004983276,
          -0.015884109,
          0.07160449,
          -0.03639271,
          0.122854576,
          -0.047071956,
          -0.11521894,
          -0.13096294,
          -0.023183137,
          0.012315676,
          -0.05767385,
          -0.09512754,
          -0.082167886,
          0.05419311,
          0.12864782,
          0.0801218,
          -0.039332956,
          -0.061769813,
          -0.09030918,
          0.04040447,
          0.12115313,
          -0.059477232,
          0.102516174,
          -0.0069349706,
          -0.027387463,
          0.097199395,
          0.074540034,
          0.0011504143,
          -0.098344326,
          0.11224158,
          0.031647995,
          -0.03181959,
          -0.110114865,
          0.08127323,
          0.1161405,
          -0.051452026,
          0.045061007,
          0.06644258,
          -0.116335735,
          -0.08773878,
          0.051105767,
          -0.13700557,
          0.009308368,
          -0.05248198,
          -0.042876616,
          0.024038047,
          0.023883283,
          -0.039851904,
          0.06320453,
          -0.00063058734,
          -0.00065621734,
          0.035557196,
          0.10341017,
          0.09614918,
          0.13028507,
          -0.12633207,
          0.06308368,
          0.10281432,
          -0.034099072,
          -0.028250463,
          -0.11385605,
          0.13349329,
          0.032291546,
          -0.089987665,
          -0.10603048,
          -0.001751557,
          0.11068353,
          0.032767966,
          -0.08514239,
          0.05259244,
          0.061250255,
          -0.094586685,
          -0.09715853,
          -0.1160996,
          0.021788046,
          0.0022163093,
          -0.10153192,
          0.012579605,
          0.007946491,
          0.09522596,
          0.01967235,
          -0.055928573,
          0.08876225,
          0.093458444,
          -0.11131293,
          0.027695328,
          0.11983083,
          0.09756155,
          0.00442864,
          0.054665953,
          -0.109686576,
          -0.058270283,
          -0.12910233,
          0.13393374,
          0.08351761,
          0.047043785,
          0.02291575,
          0.062073827,
          0.13788377,
          0.03072247,
          -0.03072264,
          0.044045165,
          0.12496813,
          -0.071840785,
          0.052129045,
          -0.07739134,
          0.055933937,
          0.10664518,
          0.11245747,
          -0.04012508,
          0.051896766,
          -0.030222617,
          -0.13410819,
          -0.014714278,
          0.11324529,
          0.12707593,
          -0.11098404,
          -0.03675644,
          -0.11987659,
          -0.08640854,
          0.01866448,
          -0.0036403984,
          0.09941453,
          -0.13701375,
          -0.096475095,
          0.072007775,
          -0.11254653,
          0.09415372,
          -0.11157976,
          -0.032345638,
          -0.118095845,
          0.06713493,
          -0.07568167,
          -0.0047449768,
          -0.09914082,
          -0.007968575,
          0.084729955,
          -0.05385402,
          -0.101107836,
          -0.13196252,
          -0.08178738,
          0.06260179,
          -0.12724021,
          -0.09443638,
          -0.07394485,
          0.04057087,
          -0.07833075,
          -0.10795262,
          -0.020380303,
          -0.046757713,
          -0.09646894,
          -0.10750498,
          0.040511146,
          0.08711514,
          0.054928795,
          0.09641673,
          0.113174126,
          -0.12135511,
          0.08730905,
          0.074559316,
          -0.027628526,
          0.06699228,
          -0.1224363,
          0.07063821,
          -0.067995556,
          -0.07596156,
          -0.035075657,
          -0.035984427,
          -0.024752766,
          0.042038992,
          -0.03769041,
          -0.067838565,
          -0.01353661,
          0.08495183,
          -0.08636342,
          0.11157715,
          0.089291036,
          0.07887085,
          0.116661325,
          -0.063714296,
          -0.13442473,
          0.10620363,
          0.029561847,
          0.061112016,
          -0.109048024,
          -0.025269046,
          0.124166,
          -0.0299984,
          -0.04881625,
          0.05037746,
          -0.036208637
        ],
        "name": "conv2d/kernel:0"
      },
      {
        "dims": [
          "32"
        ],
        "dataType": 1,
        "floatData": [
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0
        ],
        "name": "conv2d/bias:0"
      }
    ],
    "input": [
      {
        "name": "input_1",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "None"
                },
                {
                  "dimValue": "16"
                },
                {
                  "dimValue": "16"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "conv2d/kernel:0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "32"
                },
                {
                  "dimValue": "3"
                },
                {
                  "dimValue": "3"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "conv2d/bias:0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "32"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "conv2d",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "None"
                },
                {
                  "dimValue": "14"
                },
                {
                  "dimValue": "14"
                },
                {
                  "dimValue": "32"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "",
      "version": "8"
    }
  ]
}